       IDENTIFICATION DIVISION
       PROGRAM-ID. MISSING-PERIODS

       * Missing periods after division names

       DATA DIVISION
       WORKING-STORAGE SECTION
       01 SOME-VAR PIC X(10)

       PROCEDURE DIVISION
           DISPLAY "Missing periods everywhere"
           STOP RUN
