       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNDEFINED-VARIABLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DEFINED-VAR PIC 9(5) VALUE 12345.

       PROCEDURE DIVISION.
           DISPLAY DEFINED-VAR.
           DISPLAY UNDEFINED-VAR.
           MOVE 100 TO NON-EXISTENT-VAR.
           STOP RUN.
