       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOME-VAR PIC X(10).

       * Missing PROCEDURE DIVISION
       STOP RUN.
